### groupby

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({'key':['A','B','C']*3,
                   'data': np.arange(9)})
df

   data key
0     0   A
1     1   B
2     2   C
3     3   A
4     4   B
5     5   C
6     6   A
7     7   B
8     8   C

In [5]:
for key in ['A','B','C']:
    print(key,df[df['key'] == key].sum())

A data      9
key     AAA
dtype: object
B data     12
key     BBB
dtype: object
C data     15
key     CCC
dtype: object

In [6]:
df.groupby('key').sum()

     data
key
A       9
B      12
C      15

In [7]:
df.groupby('key').aggregate(np.mean)

     data
key
A       3
B       4
C       5

In [8]:
df = pd.read_csv('titanic_train.csv')

In [9]:
df.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [10]:
df.groupby('Sex')['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64